Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedError Property
 The hanger rod was disconnected because there is no structural component above.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationRodsDisconnectedError { get; }
Public Shared ReadOnly Property FabricationRodsDisconnectedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationRodsDisconnectedError {
	FailureDefinitionId^ get ();
}
static member FabricationRodsDisconnectedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace